tsung/flow-all.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="Railrangerscostanalysis.d2m6adum4h.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="60" unit="second">
      <users arrivalrate="256" unit="second"></users>
    </arrivalphase> 
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="Search" probability="15" type="ts_http">
        <request>
            <http url='/login' method="GET"></http>
        </request>
​
        <setdynvars sourcetype="random_number" start="1" end="1000">
            <var name="rndint" />
        </setdynvars>
        
        <request subst="true">
            <http url="/login" method="POST" contents="username=user%%_rndint%%&amp;password=password&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
        </request> 
​
        <setdynvars sourcetype="random_number" start="1" end="1000">
            <var name="rndint_search" />
        </setdynvars>
​
        <request subst="true">
            <http url='/users?search=user%%_rndint_search%%' method="GET"></http>
        </request>
​
        <request>
         <http url='/logout' method="GET"></http>
        </request>
    </session>
    <session name="View_Post_and_Comment" probability="30" type="ts_http">
      <request>
        <http url='/login' method="GET"></http>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="rndint" />
      </setdynvars>
      
      <request subst="true">
        <http url="/login" method="POST" contents="username=user%%_rndint%%&amp;password=password&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request> 
      <request>
        <http url='/posts' method="GET"></http>
      </request>

      <thinktime random="true" value="1"/>
      
      <request>
        <http url='/logout' method="GET"></http>
      </request>
    </session>
    <session name="Post_and_Comment" probability="20" type="ts_http">
      <request>
        <http url='/login' method="GET"></http>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="rndint" />
      </setdynvars>

      <request subst="true">
        <http url="/login" method="POST" contents="username=user%%_rndint%%&amp;password=password&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request>
      <request subst="true">
        <http url='/users/%%_rndint%%' method="GET"></http>
      </request>

      <thinktime random="true" value="1"/>
      <transaction name="create_post_comment">
        <request subst="true">
                <dyn_variable name="created_post_id" re="Location: http://.*/posts/(.*)\r"/>
          <http url='/posts' method='POST' contents="post%5Bmessage%5D=Hello" content_type="application/x-www-form-urlencoded"></http>
        </request>
        <request subst="true">
          <http url='/comments' method='POST' contents="comment%5Bpost_id%5D=%%_created_post_id%%&amp;comment%5Bcomment%5D=Hi"></http>
        </request>

        <request subst="true">
          <http url='/posts/%%_created_post_id%%/edit' method="GET"></http>
        </request>
        <request subst="true">
          <http url='/posts/%%_created_post_id%%' method='PUT' contents="post%5Bmessage%5D=Hello" content_type="application/x-www-form-urlencoded"></http>
        </request>
        <request subst="true">
          <http url='/posts/%%_created_post_id%%' method='DELETE'></http>
        </request>
        <request>
          <http url='/logout' method="GET"></http>
        </request>
      </transaction>
    </session>
        <session name="UsersandRequests" probability="15" type="ts_http">
      <request>
        <http url='/login' method="GET"></http>
      </request>
​
      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="rndint" />
      </setdynvars>
      
      <request subst="true">
        <http url="/login" method="POST" contents="username=user%%_rndint%%&amp;password=password&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
      </request> 
      <request subst="true">
        <http url='/users' method='GET'></http>
      </request>
​
      <thinktime random="true" value="1"/> 
      
      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="requestee_rndint" />
      </setdynvars>
​
      <request subst="true">
        <http url='/requests' method='POST' contents="request%5Brequestee_id%5D=%%_requestee_rndint%%"></http>
      </request>
      <request subst="true">
        <http url='/requests' method='GET'></http>
      </request>      
    </session>
        <session name="Messages" probability="20" type="ts_http">
        <request>
            <http url='/login' method="GET"></http>
        </request>
​
        <setdynvars sourcetype="random_number" start="1" end="499">
            <var name="rndint" />
        </setdynvars>
        
        <request subst="true">
            <http url="/login" method="POST" contents="username=user%%_rndint%%&amp;password=password&amp;commit=Login" content_type="application/x-www-form-urlencoded" />
        </request> 
​
        <request subst="true">
            <http url='/users/%%_rndint%%' method="GET"></http>
        </request>
​
        <request subst="true">
            <http url='/conversations/%%_rndint%%' method='GET'></http>
        </request>
        <request subst="true">
            <http url='/conversations/%%_rndint%/messages' method='POST' contents="message%5Bbody%5D=hey&amp;message%5Bconversation_id%5D=%%_rndint%%&amp;message%5Buser_id%5D=%%_rndint%%" content_type="application/x-www-form-urlencoded"></http>
        </request>
    </session>
  </sessions>
</tsung>